In [1]:
# we import our modules
import pandas as pd

In [2]:
# displaying all columns in the dataset
pd.set_option('display.max_columns', None)

#reading and displaying the dataset in pandas
data = pd.read_csv('Attrition.csv', low_memory=False)

# Made a copy of our dataset
df = data.copy()

df.head()

,id,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NumCompaniesWorked,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,1,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,2,Female,94,3,2,Sales Executive,4,Single,5993,19479,8,Y,Yes,11,3,1,80,0,8,0,1,6,4,0,5
1,2,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,3,Male,61,2,2,Research Scientist,2,Married,5130,24907,1,Y,No,23,4,4,80,1,10,3,3,10,7,1,7
2,3,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,4,Male,92,2,1,Laboratory Technician,3,Single,2090,2396,6,Y,Yes,15,3,2,80,0,7,3,3,0,0,0,0
3,4,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,4,Female,56,3,1,Research Scientist,3,Married,2909,23159,1,Y,Yes,11,3,3,80,0,8,3,3,8,7,3,0
4,5,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,1,Male,40,3,1,Laboratory Technician,2,Married,3468,16632,9,Y,No,12,3,4,80,1,6,3,3,2,2,2,2

In [3]:
# We display a little information about each column in our dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470 entries, 0 to 1469
Data columns (total 36 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   id                        1470 non-null   int64
 1   Age                       1470 non-null   int64
 2   Attrition                 1470 non-null   object
 3   BusinessTravel            1470 non-null   object
 4   DailyRate                 1470 non-null   int64
 5   Department                1470 non-null   object
 6   DistanceFromHome          1470 non-null   int64
 7   Education                 1470 non-null   int64
 8   EducationField            1470 non-null   object
 9   EmployeeCount             1470 non-null   int64
 10  EmployeeNumber            1470 non-null   int64
 11  EnvironmentSatisfaction   1470 non-null   int64
 12  Gender                    1470 non-null   object
 13  HourlyRate                1470 non-null   int64
 14  JobInvolvement            1470 non-null   int64
 15  JobLevel                  1470 non-null   int64
 16  JobRole                   1470 non-null   object
 17  JobSatisfaction           1470 non-null   int64
 18  MaritalStatus             1470 non-null   object
 19  MonthlyIncome             1470 non-null   int64
 20  MonthlyRate               1470 non-null   int64
 21  NumCompaniesWorked        1470 non-null   int64
 22  Over18                    1470 non-null   object
 23  OverTime                  1470 non-null   object
 24  PercentSalaryHike         1470 non-null   int64
 25  PerformanceRating         1470 non-null   int64
 26  RelationshipSatisfaction  1470 non-null   int64
 27  StandardHours             1470 non-null   int64
 28  StockOptionLevel          1470 non-null   int64
 29  TotalWorkingYears         1470 non-null   int64
 30  TrainingTimesLastYear     1470 non-null   int64
 31  WorkLifeBalance           1470 non-null   int64
 32  YearsAtCompany            1470 non-null   int64
 33  YearsInCurrentRole        1470 non-null   int64
 34  YearsSinceLastPromotion   1470 non-null   int64
 35  YearsWithCurrManager      1470 non-null   int64
dtypes: int64(27), object(9)
memory usage: 413.6+ KB

In [4]:
# Checked to see the sum of null values
df.isnull().sum()

id                          0
Age                         0
Attrition                   0
BusinessTravel              0
DailyRate                   0
Department                  0
DistanceFromHome            0
Education                   0
EducationField              0
EmployeeCount               0
EmployeeNumber              0
EnvironmentSatisfaction     0
Gender                      0
HourlyRate                  0
JobInvolvement              0
JobLevel                    0
JobRole                     0
JobSatisfaction             0
MaritalStatus               0
MonthlyIncome               0
MonthlyRate                 0
NumCompaniesWorked          0
Over18                      0
OverTime                    0
PercentSalaryHike           0
PerformanceRating           0
RelationshipSatisfaction    0
StandardHours               0
StockOptionLevel            0
TotalWorkingYears           0
TrainingTimesLastYear       0
WorkLifeBalance             0
YearsAtCompany              0
YearsInCurrentRole          0
YearsSinceLastPromotion     0
YearsWithCurrManager        0
dtype: int64

In [5]:
# To ensure our column haas the right data types
df.dtypes

id                           int64
Age                          int64
Attrition                   object
BusinessTravel              object
DailyRate                    int64
Department                  object
DistanceFromHome             int64
Education                    int64
EducationField              object
EmployeeCount                int64
EmployeeNumber               int64
EnvironmentSatisfaction      int64
Gender                      object
HourlyRate                   int64
JobInvolvement               int64
JobLevel                     int64
JobRole                     object
JobSatisfaction              int64
MaritalStatus               object
MonthlyIncome                int64
MonthlyRate                  int64
NumCompaniesWorked           int64
Over18                      object
OverTime                    object
PercentSalaryHike            int64
PerformanceRating            int64
RelationshipSatisfaction     int64
StandardHours                int64
StockOptionLevel             int64
TotalWorkingYears            int64
TrainingTimesLastYear        int64
WorkLifeBalance              int64
YearsAtCompany               int64
YearsInCurrentRole           int64
YearsSinceLastPromotion      int64
YearsWithCurrManager         int64
dtype: object

# Data Modeling Stage

### We begin to check our Attriion column to see if how many unique values we have in our column
### Our output shows that we have two unique values of Yes and No

In [6]:
df['Attrition'].unique()

array(['Yes', 'No'], dtype=object)

In [7]:
# we make use of the map function to reassign the data in the column
df['Attrition'] = df.Attrition.map({'Yes' : 1,
                                    'No': 0})

# Sample and display 5 rows after the transformation
df.Attrition.sample(5)

739     0
107     1
229     1
1221    0
883     0
Name: Attrition, dtype: int64

# Age column

### We only want to bring out our unique age value and have theem sorted in numerical order

In [8]:
# We get the unique values for the age column
age = df['Age'].unique()

# we then initiate a for loop to iterate through and sort our unique age
for i in sorted(age):
    print(i, end=', ')

18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60,

### Our min age is 18 and max age is 60, so we group the ages into 3 age categories

In [9]:
# Define the bin edges for age grouping
bins = [18, 31, 46, 61]

# Define labels for each age group
group = ['18-30', '31-45', '46-60']

# Apply binning to the 'Age' column using the defined bins and labels
df['Age_group'] = pd.cut(df['Age'], bins=bins, labels=group, right=False)

# Sample and display 5 rows after the transformation
df[['Age', 'Age_group']].sample(5)

      Age Age_group
1108   35     31-45
181    34     31-45
1203   53     46-60
416    38     31-45
351    32     31-45

# DistanceFromHome

### we sort out the unique values of our column in numerical order to easily get the lowest, higest and to the determine the range

In [10]:

for i in sorted(df.DistanceFromHome.unique()):
    print(i, end=', ')

1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29,

In [11]:
# Define the bin edges for distance grouping
bins= [1, 10, 20, 30]

# We define labels for our values
labels = ['Near-by', 'Far', 'Very far']

# Apply binning to the 'DistanceFromHome' column using the defined bins and labels
df['Distance_group'] = pd.cut(df['DistanceFromHome'], bins=bins, labels=labels, right=False)

# Sample and display 5 rows after the transformation
df[['DistanceFromHome', 'Distance_group']].sample(5)

     DistanceFromHome Distance_group
852                 6        Near-by
767                 3        Near-by
310                 2        Near-by
566                27       Very far
263                 2        Near-by

# PerformanceRating

In [12]:
# We get the unique values from our column
df['PerformanceRating'].unique()

array([3, 4], dtype=int64)

In [13]:
# we make use of the map function to reassign the data in the column
df.PerformanceRating = df.PerformanceRating.map({3: 'Low', 4: 'High'})

# Sample and display 5 rows after the transformation
df.PerformanceRating.sample(5)

1116    High
1098     Low
993      Low
147      Low
650      Low
Name: PerformanceRating, dtype: object

# JobLevel

In [14]:
# Display unique values in our column
df.JobLevel.unique()

array([2, 1, 3, 4, 5], dtype=int64)

In [15]:
# we make use of the map function to reassign the data in the column
df.JobLevel = df.JobLevel.map({1: 'Entry level',
                               2: 'Junior or Associate',
                               3: 'Mid level Specialist',
                               4: 'Senior',
                               5: 'Executive'})

# Sample and display 5 rows after the transformation
df.JobLevel.sample(5)

648             Entry level
1305    Junior or Associate
1071    Junior or Associate
461     Junior or Associate
1425    Junior or Associate
Name: JobLevel, dtype: object

# EnvironmentSatisfaction, RelationshipSatisfaction, JobSatisfaction, JobInvolvement

### We follow the same procedure of getting our unique values first before acting on the columns

In [16]:
# Create a list of our data columns.
columns = ['EnvironmentSatisfaction', 'RelationshipSatisfaction', 'JobSatisfaction', 'JobInvolvement']

# we then iterate through each column to check and print out then unique values it finds.
for column in columns:
    unique_values = df[column].unique()
    print(f"Unique values for {column}: {unique_values}")

Unique values for EnvironmentSatisfaction: [2 3 4 1]
Unique values for RelationshipSatisfaction: [1 4 2 3]
Unique values for JobSatisfaction: [4 2 3 1]
Unique values for JobInvolvement: [3 2 4 1]

In [17]:
# Define a function to map integer values to corresponding satisfaction levels
def map_values(value):
    if value == 1:
        return 'Very dissatisfied'
    elif value == 2:
        return 'Dissatisfied'
    elif value == 3:
        return 'Satisfied'
    else:
        return 'Very satisfied'

# Specify the columns to be transformed
columns = ['EnvironmentSatisfaction', 'RelationshipSatisfaction', 'JobSatisfaction', 'JobInvolvement']

# Apply the map_values function to each column
for column in columns:
    df[column] = df[column].apply(map_values)

In [18]:
# Sample and display 5 rows after the transformation
df[['EnvironmentSatisfaction', 'RelationshipSatisfaction', 'JobSatisfaction', 'JobInvolvement']].sample(5)

,EnvironmentSatisfaction,RelationshipSatisfaction,JobSatisfaction,JobInvolvement
290,Satisfied,Very satisfied,Very dissatisfied,Satisfied
249,Very dissatisfied,Very satisfied,Satisfied,Very satisfied
1011,Very dissatisfied,Very satisfied,Dissatisfied,Satisfied
368,Satisfied,Very dissatisfied,Satisfied,Dissatisfied
1379,Very dissatisfied,Very dissatisfied,Dissatisfied,Dissatisfied

# OverTime

### we leave our OverTime column the way it it

In [19]:
# Check for unique values
df.OverTime.unique()

array(['Yes', 'No'], dtype=object)

# WorkLifeBalance

In [20]:
# Check for unique values
df.WorkLifeBalance.unique()

array([1, 3, 2, 4], dtype=int64)

In [21]:
# Map numerical values to descriptive categories for the 'WorkLifeBalance' column
df['WorkLifeBalance'] = df['WorkLifeBalance'].map({
                                                    1: 'Bad',
                                                    2: 'Average',
                                                    3: 'Good',
                                                    4: 'Excellent'
                                                })

# Display unique values after mapping
df['WorkLifeBalance'].unique()

array(['Bad', 'Good', 'Average', 'Excellent'], dtype=object)

# Education

In [22]:
# Display unique values
df.Education.unique()

array([2, 1, 4, 3, 5], dtype=int64)

In [23]:
# Map numerical values to descriptive categories for the 'Education' column
df.Education = df.Education.map({1 : 'Technical Training',
                                             2: 'College',
                                             3: 'Bachelors degree',
                                             4: 'Masters degree',
                                             5: 'Doctorate degree'})

# Display unique values after mapping
df.Education.unique()

array(['College', 'Technical Training', 'Masters degree',
       'Bachelors degree', 'Doctorate degree'], dtype=object)

In [24]:
# Display unique values
df.EducationField.unique()

array(['Life Sciences', 'Other', 'Medical', 'Marketing',
       'Technical Degree', 'Human Resources'], dtype=object)

# StockOption

In [25]:
# Display Unique values
df.StockOptionLevel.unique()

array([0, 1, 3, 2], dtype=int64)

In [26]:
# Map numerical values to descriptive categories for the 'StockOption' column
df.StockOptionLevel = df.StockOptionLevel.map({0 : 'Level 1',
                                1: 'Level 2',
                                2: 'Level 3',
                                3: 'Level 4'})

#Dispaly unique values after mapping
df.StockOptionLevel.unique()

array(['Level 1', 'Level 2', 'Level 4', 'Level 3'], dtype=object)

# TotalWorkingYears, YearsAtCompany

In [27]:
columns = ['TotalWorkingYears', 'YearsAtCompany']

# Iterate over each column to find minimum and maximum values
for column in columns:
    # Calculate the minimum and maximum values for the column
    min_value = df[column].min()
    max_value = df[column].max()
    
    # Print the results
    print(f"Minimum and Maximum value for {column} is {min_value} and {max_value}")

Minimum and Maximum value for TotalWorkingYears is 0 and 40
Minimum and Maximum value for YearsAtCompany is 0 and 40

In [28]:
# Define the bins and corresponding group labels
bins = [0, 10, 20, 30]
group = ['1-10', '11-20', '21-30']

# Specify the columns to be processed
columns = ['TotalWorkingYears', 'YearsAtCompany']

# Iterate over each column
for col in columns:
    # Cut the data into bins and assign labels
    df[col] = pd.cut(df[col], bins=bins, labels=group, right=False)
    # Add the '31-40' category and fill missing values with it
    df[col] = df[col].cat.add_categories('31-40').fillna('31-40')

# Display a sample of the processed columns
print(df[['TotalWorkingYears', 'YearsAtCompany']].sample(5))

     TotalWorkingYears YearsAtCompany
345               1-10           1-10
830               1-10           1-10
1136              1-10           1-10
233              31-40           1-10
586               1-10           1-10

# Other Categorical Columns

In [29]:
columns = ['BusinessTravel', 'Department', 'Gender', 'MaritalStatus', 'Over18']

# Iterate over each column
for column in columns:
    # Get the unique values in the column
    unique_values = df[column].unique()
    # Print the unique values
    print(f"Unique values for {column}: {unique_values}")

Unique values for BusinessTravel: ['Travel_Rarely' 'Travel_Frequently' 'Non-Travel']
Unique values for Department: ['Sales' 'Research & Development' 'Human Resources']
Unique values for Gender: ['Female' 'Male']
Unique values for MaritalStatus: ['Single' 'Married' 'Divorced']
Unique values for Over18: ['Y']

# Selecting our columns to be used in building our  model

In [30]:
# Selecting specific columns
df = df[['Age_group', 'Attrition', 'BusinessTravel', 'DailyRate', 'Department',
       'Distance_group', 'Education', 'EducationField',
        'EnvironmentSatisfaction', 'Gender', 'HourlyRate',
       'JobInvolvement', 'JobLevel', 'JobRole', 'JobSatisfaction',
       'MaritalStatus', 'MonthlyIncome', 'MonthlyRate', 'NumCompaniesWorked',
       'Over18', 'OverTime', 'PercentSalaryHike', 'PerformanceRating',
       'RelationshipSatisfaction', 'StandardHours', 'StockOptionLevel',
       'TotalWorkingYears', 'TrainingTimesLastYear', 'WorkLifeBalance',
       'YearsAtCompany', 'YearsInCurrentRole', 'YearsSinceLastPromotion',
       'YearsWithCurrManager']]

In [31]:
# old dataset
data.sample(5)

,id,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NumCompaniesWorked,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
407,408,45,No,Travel_Rarely,192,Research & Development,10,2,Life Sciences,1,544,1,Male,69,3,1,Research Scientist,4,Married,2654,9655,3,Y,No,21,4,4,80,2,8,3,2,2,2,0,2
1108,1109,35,No,Travel_Rarely,992,Research & Development,1,3,Medical,1,1564,4,Male,68,2,1,Laboratory Technician,1,Single,2450,21731,1,Y,No,19,3,2,80,0,3,3,3,3,0,1,2
925,926,42,No,Travel_Rarely,603,Research & Development,7,4,Medical,1,1292,2,Female,78,4,2,Research Scientist,2,Married,2372,5628,6,Y,Yes,16,3,4,80,0,18,2,3,1,0,0,0
897,898,59,No,Travel_Rarely,326,Sales,3,3,Life Sciences,1,1254,3,Female,48,2,2,Sales Executive,4,Single,5171,16490,5,Y,No,17,3,4,80,0,13,2,3,6,1,0,5
1185,1186,43,No,Travel_Rarely,1291,Research & Development,15,2,Life Sciences,1,1666,3,Male,65,2,4,Research Director,3,Married,17603,3525,1,Y,No,24,4,1,80,1,14,3,3,14,10,6,11

In [32]:
# Cleaned dataset
df.sample(5)

,Age_group,Attrition,BusinessTravel,DailyRate,Department,Distance_group,Education,EducationField,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NumCompaniesWorked,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
1423,18-30,0,Travel_Rarely,581,Research & Development,Near-by,College,Life Sciences,Very satisfied,Male,63,Satisfied,Entry level,Research Scientist,Satisfied,Single,3375,17624,0,Y,No,12,Low,Very satisfied,80,Level 1,1-10,2,Excellent,1-10,2,1,2
1239,31-45,0,Travel_Frequently,163,Research & Development,Very far,Technical Training,Technical Degree,Very satisfied,Female,30,Satisfied,Junior or Associate,Manufacturing Director,Very satisfied,Single,5238,6670,2,Y,No,20,High,Very satisfied,80,Level 1,1-10,3,Average,1-10,4,1,4
1098,31-45,0,Non-Travel,1142,Research & Development,Near-by,College,Life Sciences,Very satisfied,Male,72,Satisfied,Junior or Associate,Healthcare Representative,Very satisfied,Divorced,4069,8841,3,Y,Yes,18,Low,Satisfied,80,Level 1,1-10,2,Good,1-10,2,2,2
59,31-45,0,Travel_Rarely,1115,Research & Development,Near-by,Masters degree,Life Sciences,Very dissatisfied,Male,51,Dissatisfied,Junior or Associate,Manufacturing Director,Satisfied,Divorced,5993,2689,1,Y,No,18,Low,Satisfied,80,Level 2,1-10,2,Excellent,1-10,5,0,7
1072,18-30,0,Travel_Frequently,410,Research & Development,Near-by,Technical Training,Life Sciences,Very satisfied,Female,97,Satisfied,Entry level,Laboratory Technician,Dissatisfied,Married,3180,4668,0,Y,No,13,Low,Satisfied,80,Level 4,1-10,3,Good,1-10,2,0,2

In [33]:
# Save our cleaned data into a CSV file.
df.to_csv('cleaned_attrition_dataset.csv', index=None)